const koreanMaleNames = [
    "민재",
    "도윤",
    "지호",
    "현우",
    "서준",
    "윤호",
    "찬민",
    "진서",
    "도빈",
    "성태",
    "나원",
    "산",
    "해월",
    "도민",
    "혁",
    "도현",
    "성찬",
    "태석",
    "현성",
    "상현",
    "지혁",
    "현준",
    "지환",
    "지안",
    "이현",
    "재헌",
    "제윤",
    "유현",
    "민화",
    "이신",
];

const koreanFemaleNames = [
    "소라",
    "지우",
    "유진",
    "하린",
    "서연",
    "채원",
    "지윤",
    "청아",
    "지음",
    "서하",
    "지현",
    "아현",
    "하늘",
    "채아",
    "하랑",
    "시은",
    "아연",
    "지우",
    "이영",
    "혜은",
    "연희",
    "하지",
    "도아",
    "주연",
    "하나",
];

const surnames = [
    "김",
    "이",
    "박",
    "최",
    "정",
    "윤",
    "한",
    "백",
    "서",
    "주",
    "차",
    "하",
    "유",
    "류",
    "원",
    "강",
    "성",
    "배",
    "도",
    "권",
    "전",
    "황",
];

const nations = [
    "한국",
    "일본",
    "중국",
    "태국",
    "미국"
];

const japaneseNames=[
    "유나",
    "아오이",
    "사쿠라",
    "유이",
    "하루카",
    "렌",
    "소타",
    "유토"
];

const chineseNames=[
    "리웨이",
    "왕메이",
    "장민",
    "린샤오",
    "천위",
    "류한",
    "샤오링"
];

const thaiNames=[
    "아린",
    "차야",
    "나린",
    "피차",
    "린다",
    "타완"
];

const americanMaleNames=[
    "Liam",
    "Noah",
    "James",
    "Lucas",
    "Ethan",
    "Logan"
];

const americanFemaleNames=[
    "Emma",
    "Olivia",
    "Sophia",
    "Ava",
    "Mia",
    "Charlotte"
];